# Notebook 5: Pandas

In this notebook, we will look at the package `pandas`. `pandas` is built on top of `numpy` (see Notebook 4 for more on `numpy`) and specializes in dealing with heterogenous and/or missing data stored in a labelled format. 

As this is an introductory course we will only give a brief introduction to `pandas` and a flavour of why it may be useful to you. For more information see the [`pandas` documentation here](https://pandas.pydata.org/pandas-docs/stable/).

The strength of `pandas` lies in it's ability to handle database and spreadsheet type operations that may be more familiar to users of languages such as `R` and `SQL`. 

 > **Note:** By convention, `pandas` is often aliased as `pd`.

In [155]:
import pandas as pd
import numpy as np

## Pandas dataypes

The world of `pandas` revolves predominantly around the `Series` and `DataFrame` datatypes. We shall look at each one of these in turn now.

### Pandas `Series`

A `pandas` `Series` object is an indexed one-dimensional array of data.`

In [156]:
example_series = pd.Series([2.1,3.9,4.2])
print(example_series)

0    2.1
1    3.9
2    4.2
dtype: float64

The values in a `pandas` `Series` can be converted to a `numpy` `array` using the `values` attribute like so:

In [157]:
print(example_series.values)

[2.1 3.9 4.2]

The elements of a `Series` can also be accessed using square brackets in the same way elements in a one-dimensional `numpy` array are accessed. For example;

In [158]:
print(example_series[0])
print(example_series[0:2])
print(example_series[example_series>3])

2.1
0    2.1
1    3.9
dtype: float64
1    3.9
2    4.2
dtype: float64

One of the key features of a `Series` object is that you can also change how data is indexed. For example, when creating a `Series` alternate indices can be specified using the `index` argument like so:

In [159]:
example_series = pd.Series([2.1,3.9,4.2],
                           index=['a', 'b', 'c'])

The indices specified above can now be used to access the data, much like using keys to access a Python `dict`, i.e. using square brackets.

In [179]:
print(example_series['b'])

33

It is worth noting that numerical indices can still be used like so:

In [160]:
print(example_series[2])

4.2

In fact, `numpy` style array indexing syntax can be used on custom indices. For example, the colon operator, `:`, can still be used for indexing, but on non-numerical indices, like so:

In [ ]:
print(example_series['a':'b'])

 > **Note**: This indexing, unlike `numpy`, is inclusive. For example, `'a':'b'` includes element `'b'`, unlike in `numpy` where `0:2` does not include element `2`.
 
 > **Note:** If a number is used as a custom index for a column; the custom indices take precedence over the inbuilt `numpy` like indexing. For example:

In [163]:
# We have tried to label the first element in the Series as 2
example_series = pd.Series([2.1,3.9,4.2],
                           index=[2, 'b', 'c'])

# Lets see whether we get the first element like we specified
# or if we get the 3rd element like in normal python zero indexing
print(example_series[2])
# Spoiler Alert: We got the first element!

2.1

A `pandas` `Series` can also be constructed from a `dict`. When a `Series` is constructed using a `dict`, the keys in the `dict` become the indices of the `Series` and the values in the `dict` become the values in the `Series`. For example;

In [180]:
# A simple dict with 3 key-value pairs
example_dict = {'a': 1, 'b': 33, 'c': 2}
print(example_dict)

# Converted to a series
example_series = pd.Series(example_dict)
print(example_series)

{'a': 1, 'b': 33, 'c': 2}
a     1
b    33
c     2
dtype: int64

Elements in the `Series` can now be accessed using the corresponding keys from the `dict` like so:

In [181]:
print(example_dict['b'])
print(example_dict['c'])

33
2

 > **Note:** You can also use the `index` argument when constructing a `Series` from a `dict`. However, only values with indices included **both** as keys in the `dict` and elements in `index` argument will be kept. This may seem clearer with an example:

In [182]:
# We have specified 3 indices, 'a', 'b' and 'c'
example_dict = {'a': 1, 'b': 33, 'c': 2}

print(example_dict)

# Now, we choose to use only 'a' and 'c' so only 'a' and 'c'
# will be in the Series object
print(pd.Series(example_dict, index=['a','c']))

{'a': 1, 'b': 33, 'c': 2}
a    1
c    2
dtype: int64

## Pandas `Dataframes`

A `pandas` `DataFrame` object can be thought of as a collection of aligned `pandas` `Series` objects, where by aligned we mean sharing the same index. A `DataFrame` can be constructed from several `Series` using the `pandas.DataFrame` function. For example:

In [183]:
# Series of heights in inches
heights = pd.Series({'Pete': 69, 'Mo': 72, 'Katy': 64, 'Alex': 80})
# Series of weights in kg
weights = pd.Series({'Pete': 60, 'Mo': 80, 'Jay': 55, 'Claire': 70})

example_dataframe = pd.DataFrame({'heights': heights, 'weights': weights})

# In this notebook we can display a pandas dataframe in a
# nice format without printing just by typing the dataframes
# name.
example_dataframe

        heights  weights
Alex       80.0      NaN
Claire      NaN     70.0
Jay         NaN     55.0
Katy       64.0      NaN
Mo         72.0     80.0
Pete       69.0     60.0

 > **Note:** The `Series` objects used to create a `DataFrame` do not have to contain the same indices as one another to be combined to make a `DataFrame`. In the above example `Claire` appeared in the `weights` series but not the `heights` series. One of the great features of `Pandas` is that it will automatically fill any missing values in with an `NaN` (such as Claire's height in this example). 

A `DataFrame` can also be constructed from a `dict` of `dict`s like so:

In [184]:
# Series of heights in inches
heights = {'Pete': 69, 'Mo': 72, 'Katy': 64, 'Alex': 80}
# Series of weights in kg
weights = {'Pete': 60, 'Mo': 80, 'Jay': 55, 'Claire': 70}

example_dataframe = pd.DataFrame({'heights': heights, 'weights': weights})

example_dataframe

        heights  weights
Alex       80.0      NaN
Claire      NaN     70.0
Jay         NaN     55.0
Katy       64.0      NaN
Mo         72.0     80.0
Pete       69.0     60.0

Finally, a `DataFrame` can also be constructed from a `numpy` array like so;

In [185]:
example_dataframe = pd.DataFrame(
    np.array([[62,66,75],[63,65,71]]))

example_dataframe

    0   1   2
0  62  66  75
1  63  65  71

Rows and columns can be lablled with the `index` and `columns` arguments respectively:

In [186]:
example_dataframe = pd.DataFrame(
    np.array([[62,66,75],[63,65,71]]),
    columns=['heights', 'weights', 'favourite number'],
    index=['Joe', 'Catelyn'])

example_dataframe

         heights  weights  favourite number
Joe           62       66                75
Catelyn       63       65                71

## Getting indices

The indices can be retrieved from a `Series` or `DataFrame` using the `index` attribute. This can be done like so;

In [177]:
print(example_series.index)
print(example_dataframe.index)

Index(['a', 'b', 'c'], dtype='object')
Index(['Joe', 'Catelyn'], dtype='object')

The column headers from a `DataFrame` can also be retrieved using the `columns` attribute.

In [178]:
print(example_dataframe.columns)

Index(['heights', 'weights', 'favourite number'], dtype='object')

## Working with Pandas

The `pandas` datatypes are incredibly useful and efficient when dealing with heterogeneous data. In this section we will give a, by no means comprehenive, selection of useful functions that `pandas` offers. We will use the below `DataFrame` in the following examples.

In [224]:
example_dataset = pd.read_csv('05_pandas/toydataset.csv')

# Show our dataset
example_dataset

    eyelash_length  subject_ID  birth_year group  sex
0         0.977130         0.0      1986.0     a    M
1         0.744932         1.0      1982.0     a    M
2         0.771252         2.0      1980.0     b    M
3         0.031632         3.0      1982.0     c    F
4         0.143346         4.0      1982.0     d    M
5         0.761548         5.0      1985.0   NaN    F
6         0.152072         6.0      1985.0     a    F
7         0.353161         7.0      1981.0     c    M
8         0.704428         8.0      1984.0     b    F
9         0.566190         9.0      1985.0     e    F
10        0.314832        10.0      1984.0     a    M
11             NaN        11.0      1983.0     b    M
12        0.089622        12.0      1987.0     c    M
13        0.888279        13.0      1984.0     a    F
14        0.985746        14.0      1980.0     b    M
15        0.294427        15.0      1983.0     c    F
16        0.639467        16.0      1984.0     d    F
17        0.647810        17.0      1985.0     e    M
18        0.970794        18.0      1986.0     e    F
19        0.077271        19.0      1980.0     e    F
20        0.185788        20.0      1989.0     d    M
21        0.334792         NaN      1980.0     c    F
22        0.321671        22.0      1989.0     d    M
23        0.374251         NaN      1989.0     a    F
24             NaN        24.0      1989.0     e    F
25        0.199059        25.0      1980.0     b    M
26        0.398672        26.0      1980.0     c    F
27        0.969747        27.0      1985.0     a  NaN
28        0.343173        28.0      1985.0     e    M
29        0.010472        29.0      1980.0     d    F
30        0.456330        30.0      1983.0     d    F
31        0.108813        31.0      1981.0     e    F
32        0.300370        32.0      1986.0   NaN    M
33        0.071913        33.0      1984.0     c    F
34        0.982426        34.0      1983.0     b    F
35        0.395277        35.0      1985.0     e  NaN
36        0.431779        36.0      1989.0     a    M
37        0.253415        37.0      1988.0     b    F
38        0.796585        38.0      1988.0     c    M
39        0.914784        39.0      1981.0     a    M
40        0.882716        40.0      1985.0     d    F
41        0.410311        41.0      1988.0     d    M
42        0.415403        42.0      1984.0     a    M
43        0.927441        43.0      1983.0     b    F
44        0.405798        44.0      1982.0     b    F
45        0.700831        45.0      1985.0     c    F
46        0.670304        46.0      1988.0     e    M
47        0.492510        47.0         NaN     c    F
48        0.591842        48.0      1986.0     d    M
49        0.168587        49.0      1986.0     b    F

### Boolean indexing

Boolean indexing can be used to return subsets of a `DataFrame`. What is particularly nice about this is that in `Pandas` boolean logic is much easier to interpret, due to the use of column names. For example, hopefully, the below line of code should be fairly intuitive;

In [188]:
example_dataset[(example_dataset['sex']=='M') & 
                (example_dataset['birth_year']>1987)]

    eyelash_length  subject_ID  birth_year group sex
11        0.600696        11.0      1989.0     b   M
17        0.795927        17.0      1989.0     e   M
20        0.276136         NaN      1988.0     d   M
38        0.182815        38.0      1989.0     c   M

 > **Note:** When using multiple boolean statements always use `()` brackets to make your logic clearer and less susceptible to coding errors.

This above is useful but the notation is a bit clunky - we had to type `example_dataset` three times to do this operation. We can do this in a much cleaner fashion using the `query` function.

### Querying

We can perform the same operation as in the above section with much cleaner syntax using the `query` function like so:

In [189]:
example_dataset.query('(sex == "M") & (birth_year > 1987)')

    eyelash_length  subject_ID  birth_year group sex
11        0.600696        11.0      1989.0     b   M
17        0.795927        17.0      1989.0     e   M
20        0.276136         NaN      1988.0     d   M
38        0.182815        38.0      1989.0     c   M

 > **Warning:** The `query` function may have problems with column names which can't be used as python identifiers (for example column names including a space). This is a common cause of `SyntaxError`'s for users new to `Pandas`.

### Removing `NaN`s

When selecting data it may be desirable to first remove `NaN` values/missing data which could interfere with future operations. Rows with `NaN` values in a specified column can be found and removed using the `isna` function like so:

In [190]:
# Remove all subjects for whom we didn't record sex
example_dataset[~example_dataset.sex.isna()]

    eyelash_length  subject_ID  birth_year group sex
0         0.724220         0.0      1984.0     a   M
1         0.640551         1.0      1981.0     a   M
3         0.694994         3.0      1980.0     c   F
4         0.245199         NaN      1986.0     d   M
5         0.739096         5.0      1984.0     e   F
6         0.870887         6.0      1986.0     a   F
7         0.738528         7.0      1984.0     c   M
8         0.956438         8.0      1985.0     b   F
9         0.660350         9.0      1983.0     e   F
10        0.021928        10.0      1985.0     a   M
11        0.600696        11.0      1989.0     b   M
12        0.129942        12.0      1985.0     c   M
13        0.184376        13.0      1981.0   NaN   F
14        0.372659        14.0      1982.0     b   M
15        0.602618        15.0      1984.0     c   F
16        0.141397        16.0      1980.0     d   F
17        0.795927        17.0      1989.0     e   M
18        0.406940        18.0      1986.0     e   F
19        0.412461        19.0      1985.0     e   F
20        0.276136         NaN      1988.0     d   M
21        0.461224        21.0      1981.0     c   F
22        0.062707        22.0      1987.0     d   M
23        0.423228        23.0      1983.0     a   F
24        0.027031        24.0      1986.0   NaN   F
25        0.852269        25.0      1981.0     b   M
26        0.810419        26.0      1985.0     c   F
27        0.563723        27.0      1980.0     a   M
28        0.417642        28.0      1985.0     e   M
29        0.070245        29.0      1982.0     d   F
30        0.092804        30.0      1987.0     d   F
31        0.473111        31.0      1987.0     e   F
32             NaN        32.0      1985.0     a   M
33        0.577019        33.0      1988.0     c   F
34        0.431959        34.0      1987.0     b   F
35        0.497809        35.0      1983.0     e   F
36        0.624989        36.0      1984.0     a   M
37        0.129610         NaN      1984.0     b   F
38        0.182815        38.0      1989.0     c   M
39        0.235812        39.0      1982.0   NaN   M
41        0.024210        41.0      1980.0     d   M
42        0.302861        42.0      1984.0     a   M
43        0.953709        43.0      1983.0     b   F
44        0.854992        44.0      1982.0     b   F
45        0.036628        45.0      1982.0     c   F
46        0.073756        46.0         NaN     e   M
47        0.281555        47.0      1981.0     c   F
48        0.125552        48.0      1982.0     d   M
49        0.393074        49.0      1984.0     b   F

There is actually a method that does this in a much neater fashion; the `dropna` method.

In [191]:
# Remove all subjects with missing sex and birthyear information
example_dataset.dropna(subset=['birth_year', 'sex'])

    eyelash_length  subject_ID  birth_year group sex
0         0.724220         0.0      1984.0     a   M
1         0.640551         1.0      1981.0     a   M
3         0.694994         3.0      1980.0     c   F
4         0.245199         NaN      1986.0     d   M
5         0.739096         5.0      1984.0     e   F
6         0.870887         6.0      1986.0     a   F
7         0.738528         7.0      1984.0     c   M
8         0.956438         8.0      1985.0     b   F
9         0.660350         9.0      1983.0     e   F
10        0.021928        10.0      1985.0     a   M
11        0.600696        11.0      1989.0     b   M
12        0.129942        12.0      1985.0     c   M
13        0.184376        13.0      1981.0   NaN   F
14        0.372659        14.0      1982.0     b   M
15        0.602618        15.0      1984.0     c   F
16        0.141397        16.0      1980.0     d   F
17        0.795927        17.0      1989.0     e   M
18        0.406940        18.0      1986.0     e   F
19        0.412461        19.0      1985.0     e   F
20        0.276136         NaN      1988.0     d   M
21        0.461224        21.0      1981.0     c   F
22        0.062707        22.0      1987.0     d   M
23        0.423228        23.0      1983.0     a   F
24        0.027031        24.0      1986.0   NaN   F
25        0.852269        25.0      1981.0     b   M
26        0.810419        26.0      1985.0     c   F
27        0.563723        27.0      1980.0     a   M
28        0.417642        28.0      1985.0     e   M
29        0.070245        29.0      1982.0     d   F
30        0.092804        30.0      1987.0     d   F
31        0.473111        31.0      1987.0     e   F
32             NaN        32.0      1985.0     a   M
33        0.577019        33.0      1988.0     c   F
34        0.431959        34.0      1987.0     b   F
35        0.497809        35.0      1983.0     e   F
36        0.624989        36.0      1984.0     a   M
37        0.129610         NaN      1984.0     b   F
38        0.182815        38.0      1989.0     c   M
39        0.235812        39.0      1982.0   NaN   M
41        0.024210        41.0      1980.0     d   M
42        0.302861        42.0      1984.0     a   M
43        0.953709        43.0      1983.0     b   F
44        0.854992        44.0      1982.0     b   F
45        0.036628        45.0      1982.0     c   F
47        0.281555        47.0      1981.0     c   F
48        0.125552        48.0      1982.0     d   M
49        0.393074        49.0      1984.0     b   F

###  Sorting data

One operation which you may want to do when first looking at data is sort it by a variable of interest. Sorting can be done in `pandas` using the `sort_values` method. For example;

In [192]:
sorted_example = example_dataset.sort_values('birth_year')
sorted_example

    eyelash_length  subject_ID  birth_year group  sex
27        0.563723        27.0      1980.0     a    M
3         0.694994         3.0      1980.0     c    F
16        0.141397        16.0      1980.0     d    F
41        0.024210        41.0      1980.0     d    M
1         0.640551         1.0      1981.0     a    M
47        0.281555        47.0      1981.0     c    F
21        0.461224        21.0      1981.0     c    F
25        0.852269        25.0      1981.0     b    M
13        0.184376        13.0      1981.0   NaN    F
45        0.036628        45.0      1982.0     c    F
44        0.854992        44.0      1982.0     b    F
48        0.125552        48.0      1982.0     d    M
29        0.070245        29.0      1982.0     d    F
39        0.235812        39.0      1982.0   NaN    M
14        0.372659        14.0      1982.0     b    M
23        0.423228        23.0      1983.0     a    F
43        0.953709        43.0      1983.0     b    F
35        0.497809        35.0      1983.0     e    F
9         0.660350         9.0      1983.0     e    F
0         0.724220         0.0      1984.0     a    M
42        0.302861        42.0      1984.0     a    M
36        0.624989        36.0      1984.0     a    M
37        0.129610         NaN      1984.0     b    F
49        0.393074        49.0      1984.0     b    F
5         0.739096         5.0      1984.0     e    F
7         0.738528         7.0      1984.0     c    M
15        0.602618        15.0      1984.0     c    F
12        0.129942        12.0      1985.0     c    M
19        0.412461        19.0      1985.0     e    F
26        0.810419        26.0      1985.0     c    F
28        0.417642        28.0      1985.0     e    M
32             NaN        32.0      1985.0     a    M
8         0.956438         8.0      1985.0     b    F
40        0.739418        40.0      1985.0     d  NaN
10        0.021928        10.0      1985.0     a    M
4         0.245199         NaN      1986.0     d    M
6         0.870887         6.0      1986.0     a    F
24        0.027031        24.0      1986.0   NaN    F
18        0.406940        18.0      1986.0     e    F
22        0.062707        22.0      1987.0     d    M
34        0.431959        34.0      1987.0     b    F
31        0.473111        31.0      1987.0     e    F
30        0.092804        30.0      1987.0     d    F
33        0.577019        33.0      1988.0     c    F
2         0.711291         2.0      1988.0     b  NaN
20        0.276136         NaN      1988.0     d    M
38        0.182815        38.0      1989.0     c    M
17        0.795927        17.0      1989.0     e    M
11        0.600696        11.0      1989.0     b    M
46        0.073756        46.0         NaN     e    M

To obtain a row of the new sorted DataFrame, the `iloc` function can be used to index it like so:

In [193]:
sorted_example.iloc[0]

eyelash_length    0.563723
subject_ID              27
birth_year            1980
group                    a
sex                      M
Name: 27, dtype: object

 > **Note:** We can still select the index `0` of the DataFrame under it's **original ordering** using `loc`. Be careful doing this, however, as it can be very easy to confuse the `loc` and `iloc` methods.

In [194]:
sorted_example.loc[0]

eyelash_length    0.72422
subject_ID              0
birth_year           1984
group                   a
sex                     M
Name: 0, dtype: object

### Summarizing by column

Another great strength of the `pandas` package is that, much like `numpy`, it contains several methods for getting summary measures of columns of data. For example:

In [195]:
# Mean
example_dataset.mean()

eyelash_length       0.441772
subject_ID          24.765957
birth_year        1984.163265
dtype: float64

In [196]:
# Standard deviation
example_dataset.std()

eyelash_length     0.285430
subject_ID        14.605259
birth_year         2.576714
dtype: float64

In [197]:
# Count number of non-missing/non-NaN values
example_dataset.count()

eyelash_length    49
subject_ID        47
birth_year        49
group             47
sex               48
dtype: int64

One function which is useful as a sanity check whenever you are working in `pandas` is the `describe` method, which gives several common summary statistics of the data.

In [198]:
example_dataset.describe()

# (The percentages in this table are quantiles)

       eyelash_length  subject_ID   birth_year
count       49.000000   47.000000    49.000000
mean         0.441772   24.765957  1984.163265
std          0.285430   14.605259     2.576714
min          0.021928    0.000000  1980.000000
25%          0.182815   12.500000  1982.000000
50%          0.423228   25.000000  1984.000000
75%          0.694994   37.000000  1986.000000
max          0.956438   49.000000  1989.000000

We can also use our own custom functions to apply to the columns of a `DataFrame` using the `apply` method. For example:

In [202]:
# Function to make a T statistic for the t-test that
# the mean=1984.5
#
# i.e. T = (mean-1985)/(std/sqrt(n))
def tstat(series):
    
    # Get T statistic
    tStat = (series.mean()-1984.5)/(series.std()/np.sqrt(series.count()))
    
    return(tStat)

# Return the T statistics... all but birth year should have large 
# T statistic values as only the birth years had mean 1984.5
example_dataset.select_dtypes(np.number).apply(tstat)

eyelash_length   -48657.873860
subject_ID         -919.891900
birth_year           -0.914786
dtype: float64

 > **Warning:** When applying custom functions to a `DataFrame` you must ensure you specify which datatypes you want to apply your function to. In the above we used the `select_dtypes` argument to specify that we wanted to apply our function to any column containing entries that are `np.number` objects (i.e. `np.int64`, `np.float32`, etc...).

The `apply` method actually allows us to apply several functions at once. For example:

In [203]:
example_dataset.select_dtypes(np.number).apply([tstat, 
                                                'mean', 
                                                np.prod])

       eyelash_length  subject_ID     birth_year
tstat   -4.865787e+04 -919.891900  -9.147863e-01
mean     4.417715e-01   24.765957   1.984163e+03
prod     7.446845e-26    0.000000  3.813074e+161

### Summarizing by groupings

One extremely useful tool is the `groupby` tool which groups the data based on categorical variables of the users choosing. This returns an object, can be iterated through like so:

In [ ]:
for sex, table_for_category in example_dataset.groupby('sex'):
    
    print(f'Mean age for sex {sex}: {row.birth_year.mean()}')

A more common application of the `groupby` method, however, is combining it with the `apply` function to get summary measures for groups. This is an extremely powerful functionality. For example;

In [204]:
example_dataset.groupby('group').mean()

       eyelash_length  subject_ID   birth_year
group
a            0.521548   19.666667  1983.555556
b            0.625670   25.555556  1984.500000
c            0.451574   24.700000  1983.900000
d            0.197519   32.285714  1984.111111
e            0.497455   23.111111  1985.250000

It is also possible to group by the intersection of multiple categories like so:

In [205]:
example_dataset.groupby(['sex','group']).mean()

           eyelash_length  subject_ID   birth_year
sex group
F   a            0.647057   14.500000  1984.500000
    b            0.619964   35.600000  1984.166667
    c            0.494922   27.142857  1983.000000
    d            0.101482   25.000000  1983.000000
    e            0.531628   19.500000  1984.666667
M   a            0.479712   21.142857  1983.285714
    b            0.608541   16.666667  1984.000000
    c            0.350428   19.000000  1986.000000
    d            0.146761   37.000000  1984.600000
    e            0.429108   30.333333  1987.000000

 > **Note:** If one of the entries in the above is `NaN` then there were no subjects of that sex in that group.

It is even possible to do multiple groupings and multiple summary statistics at the same time!

In [206]:
# Get the mean and median for each (sex, group) combination 
example_dataset.groupby(['sex','group']).aggregate((np.median, np.mean))

          eyelash_length           subject_ID            birth_year  \
                  median      mean     median       mean     median
sex group
F   a           0.647057  0.647057       14.5  14.500000     1984.5
    b           0.643475  0.619964       43.0  35.600000     1984.0
    c           0.577019  0.494922       26.0  27.142857     1982.0
    d           0.092804  0.101482       29.0  25.000000     1982.0
    e           0.485460  0.531628       18.5  19.500000     1984.5
M   a           0.594356  0.479712       27.0  21.142857     1984.0
    b           0.600696  0.608541       14.0  16.666667     1982.0
    c           0.182815  0.350428       12.0  19.000000     1985.0
    d           0.125552  0.146761       41.0  37.000000     1986.0
    e           0.417642  0.429108       28.0  30.333333     1987.0


                  mean
sex group
F   a      1984.500000
    b      1984.166667
    c      1983.000000
    d      1983.000000
    e      1984.666667
M   a      1983.285714
    b      1984.000000
    c      1986.000000
    d      1984.600000
    e      1987.000000

It might also be useful stratify based on a continuous variable. This can be done easily using the `cut` function like so:

In [207]:
# Split the years into groups and take their means
example_dataset.groupby(
    pd.cut(example_dataset.birth_year, 
           bins=(1979, 1983, 1986, 1990))).mean()

              eyelash_length  subject_ID   birth_year
birth_year
(1979, 1983]        0.425015   27.526316  1981.526316
(1983, 1986]        0.489121   20.944444  1984.800000
(1986, 1990]        0.420447   24.222222  1987.900000

### Reshaping

Suppose we were interested in the mean `eyelash_length` of every `group` for each `birth_year`. We could do the following;

In [208]:
example_dataset.groupby(['birth_year','group']).eyelash_length.mean()

birth_year  group
1980.0      a        0.563723
            c        0.694994
            d        0.082804
1981.0      a        0.640551
            b        0.852269
            c        0.371389
1982.0      b        0.613825
            c        0.036628
            d        0.097898
1983.0      a        0.423228
            b        0.953709
            e        0.579079
1984.0      a        0.550690
            b        0.261342
            c        0.670573
            e        0.739096
1985.0      a        0.021928
            b        0.956438
            c        0.470180
            d        0.739418
            e        0.415051
1986.0      a        0.870887
            d        0.245199
            e        0.406940
1987.0      b        0.431959
            d        0.077755
            e        0.473111
1988.0      b        0.711291
            c        0.577019
            d        0.276136
1989.0      b        0.600696
            c        0.182815
            e        0.795927
Name: eyelash_length, dtype: float64

However, there are 10 `birth_year`s and 5 `group`s. This means there are potentially up to 50 lines in the above table. In this example, we probably wouldn't worry too much but on real data this could result in us getting very large tables very quickly!

One way around this is to use the `unstack` method, which moves one of the groupings in the rows into the columns like so:

In [209]:
example_dataset.groupby(
                ['birth_year','group']
            ).eyelash_length.mean().unstack('group')

group              a         b         c         d         e
birth_year
1980.0      0.563723       NaN  0.694994  0.082804       NaN
1981.0      0.640551  0.852269  0.371389       NaN       NaN
1982.0           NaN  0.613825  0.036628  0.097898       NaN
1983.0      0.423228  0.953709       NaN       NaN  0.579079
1984.0      0.550690  0.261342  0.670573       NaN  0.739096
1985.0      0.021928  0.956438  0.470180  0.739418  0.415051
1986.0      0.870887       NaN       NaN  0.245199  0.406940
1987.0           NaN  0.431959       NaN  0.077755  0.473111
1988.0           NaN  0.711291  0.577019  0.276136       NaN
1989.0           NaN  0.600696  0.182815       NaN  0.795927

This shorter table is often referred to as "wide form" whilst the taller is referred to as "long form". 

There are many reasons you may want to work with both forms of data. For example, it often more convenient to group data using long form tables but often easier to generate plots with wide form tables. Often, the choice of format is also a question of personal preference.

You can convert wide form back to long form using the `stack` method like so:

In [210]:
# Unstack the dataframe
unstacked = example_dataset.groupby(
                ['birth_year','group']
            ).eyelash_length.mean().unstack('group')

# Stack the dataframe
stacked = unstacked.stack('group')

stacked

birth_year  group
1980.0      a        0.563723
            c        0.694994
            d        0.082804
1981.0      a        0.640551
            b        0.852269
            c        0.371389
1982.0      b        0.613825
            c        0.036628
            d        0.097898
1983.0      a        0.423228
            b        0.953709
            e        0.579079
1984.0      a        0.550690
            b        0.261342
            c        0.670573
            e        0.739096
1985.0      a        0.021928
            b        0.956438
            c        0.470180
            d        0.739418
            e        0.415051
1986.0      a        0.870887
            d        0.245199
            e        0.406940
1987.0      b        0.431959
            d        0.077755
            e        0.473111
1988.0      b        0.711291
            c        0.577019
            d        0.276136
1989.0      b        0.600696
            c        0.182815
            e        0.795927
dtype: float64

An alternative to the `groupby`, `stack` and `unstack` approach is to use the functions `pivot_table` and `melt`.

`pivot_table` is particularly useful as, not only does it unstack the table, but it also handles grouping at the same time. For example, we could perform the same unstacking operation we did earlier with `groupby` and `unstack` using `pivot_table` like so:

In [212]:
unstacked = example_dataset.pivot_table('eyelash_length', 
                                      'birth_year', 
                                      'group')
unstacked

group              a         b         c         d         e
birth_year
1980.0      0.563723       NaN  0.694994  0.082804       NaN
1981.0      0.640551  0.852269  0.371389       NaN       NaN
1982.0           NaN  0.613825  0.036628  0.097898       NaN
1983.0      0.423228  0.953709       NaN       NaN  0.579079
1984.0      0.550690  0.261342  0.670573       NaN  0.739096
1985.0      0.021928  0.956438  0.470180  0.739418  0.415051
1986.0      0.870887       NaN       NaN  0.245199  0.406940
1987.0           NaN  0.431959       NaN  0.077755  0.473111
1988.0           NaN  0.711291  0.577019  0.276136       NaN
1989.0           NaN  0.600696  0.182815       NaN  0.795927

We can unstack the table we just made with the `melt` method. This is a little more fiddly, however, as in the previous example, using `pivot_table` changed the `birth_year` variable from a column in the table to the row index.

In [213]:
# Change `birth_year` back to a column
unstacked['birth_year'] = unstacked.index

# Unstack our table
stacked = pd.melt(unstacked, id_vars=['birth_year'], value_vars=['a','b','c','d','e'],
         var_name='group', value_name='eyelash_length')

# Our table will not be in the original order but we can sort that
# After sorting the indices will be out of order so we reset those.
stacked.sort_values(['birth_year', 'group']).reset_index()

    index  birth_year group  eyelash_length
0       0      1980.0     a        0.563723
1      10      1980.0     b             NaN
2      20      1980.0     c        0.694994
3      30      1980.0     d        0.082804
4      40      1980.0     e             NaN
5       1      1981.0     a        0.640551
6      11      1981.0     b        0.852269
7      21      1981.0     c        0.371389
8      31      1981.0     d             NaN
9      41      1981.0     e             NaN
10      2      1982.0     a             NaN
11     12      1982.0     b        0.613825
12     22      1982.0     c        0.036628
13     32      1982.0     d        0.097898
14     42      1982.0     e             NaN
15      3      1983.0     a        0.423228
16     13      1983.0     b        0.953709
17     23      1983.0     c             NaN
18     33      1983.0     d             NaN
19     43      1983.0     e        0.579079
20      4      1984.0     a        0.550690
21     14      1984.0     b        0.261342
22     24      1984.0     c        0.670573
23     34      1984.0     d             NaN
24     44      1984.0     e        0.739096
25      5      1985.0     a        0.021928
26     15      1985.0     b        0.956438
27     25      1985.0     c        0.470180
28     35      1985.0     d        0.739418
29     45      1985.0     e        0.415051
30      6      1986.0     a        0.870887
31     16      1986.0     b             NaN
32     26      1986.0     c             NaN
33     36      1986.0     d        0.245199
34     46      1986.0     e        0.406940
35      7      1987.0     a             NaN
36     17      1987.0     b        0.431959
37     27      1987.0     c             NaN
38     37      1987.0     d        0.077755
39     47      1987.0     e        0.473111
40      8      1988.0     a             NaN
41     18      1988.0     b        0.711291
42     28      1988.0     c        0.577019
43     38      1988.0     d        0.276136
44     48      1988.0     e             NaN
45      9      1989.0     a             NaN
46     19      1989.0     b        0.600696
47     29      1989.0     c        0.182815
48     39      1989.0     d             NaN
49     49      1989.0     e        0.795927

 > **Note:** Our table is now longer. This is because we have included `NaN`/missing values we didn't include in our original table. We could remove these easily though, for example, with the `dropna` method.

In [214]:
stacked.dropna()

    birth_year group  eyelash_length
0       1980.0     a        0.563723
1       1981.0     a        0.640551
3       1983.0     a        0.423228
4       1984.0     a        0.550690
5       1985.0     a        0.021928
6       1986.0     a        0.870887
11      1981.0     b        0.852269
12      1982.0     b        0.613825
13      1983.0     b        0.953709
14      1984.0     b        0.261342
15      1985.0     b        0.956438
17      1987.0     b        0.431959
18      1988.0     b        0.711291
19      1989.0     b        0.600696
20      1980.0     c        0.694994
21      1981.0     c        0.371389
22      1982.0     c        0.036628
24      1984.0     c        0.670573
25      1985.0     c        0.470180
28      1988.0     c        0.577019
29      1989.0     c        0.182815
30      1980.0     d        0.082804
32      1982.0     d        0.097898
35      1985.0     d        0.739418
36      1986.0     d        0.245199
37      1987.0     d        0.077755
38      1988.0     d        0.276136
43      1983.0     e        0.579079
44      1984.0     e        0.739096
45      1985.0     e        0.415051
46      1986.0     e        0.406940
47      1987.0     e        0.473111
49      1989.0     e        0.795927

### Reading/Writing files

One final footnote on `pandas` is that it is extremely fast at reading and writing files.

`pandas` provides a wide range of tools for loading from text files, binary files, and SQL databases. The most commonly used function for this purpose is the `pandas.read_{format}` function. For example, to read `csv` files we can do:

In [215]:
dataframe_from_csv = pd.read_csv('05_pandas/example_data.csv')

We can also write to a csv using the `pandas.to_csv`  like so:

In [216]:
X = pd.DataFrame(np.random.randn(1000,1000))

X.to_csv('05_pandas/example_data_we_made.csv')

This is one of the fastest file reading tools in Python and worth knowing about! For example, compare the time `pandas` took to read the example `csv` to the time `numpy` takes.

In [217]:
import time

# Let's time pandas
t1 = time.time()
array_from_csv = pd.read_csv('05_pandas/example_data.csv').values
t2 = time.time()
print('pandas took ', t2-t1, ' seconds to read the csv file.')

# Now time numpy
t1 = time.time()
array_from_csv = np.loadtxt('05_pandas/example_data.csv', delimiter=',')
t2 = time.time()
print('numpy took ', t2-t1, ' seconds to read the csv file.')

pandas took  0.4046623706817627  seconds to read the csv file.
numpy took  0.9881961345672607  seconds to read the csv file.

## Using `pandas`

`pandas` is an extremely powerful tool. We have barely scratched the surface on it's capabilities here. To learn more, please see the official [`pandas` documentation here](https://pandas.pydata.org/).

# Exercises

**Question 1:** Read in the file `exercise_dataset.csv` as a pandas DataFrame. We are not interested in the `subject_id` and `age` variables so remove these from the DataFrame. *Hint: The [`drop`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html) function may be useful for this*.

In [ ]:
# Write your answer here

**Question 2:** After collecting this data, you have found out that some, an extremely small minority in fact, of the subjects thought it would be funny to deliberately fill out the `favourite_animal` field in your survey with an object that is not an animal! Fearing these subjects may have filled out other values incorrectly, you wish to remove them from the DataFrame immediately.

Investigate the `.value_counts()` function in the [`Pandas` documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.value_counts.html). What does this function do? Use the function to find the rows of the DataFrame with non-animal responses in the `favourite_animal` column and remove the rows from the DataFrame.

In [ ]:
# Write your answer here

**Question 3:** Your research is interested in the relationship between the size of the big toe on the left foot of each subject (`size_of_left_toe`) and the subjects heartrates (`heartrate`). Because of this, you have decided that you don't want to include any subjects which have any `NaN` values in either the `size_of_left_toe` or `heartrate` columns.

Remove all rows of the DataFrame which include `NaN` values in either the `size_of_left_toe` or `heartrate` columns.

In [ ]:
# Write your answer here

**Question 4:** Write a function which takes in a numpy array and a percentage $k$ and returns the k% quantile of the array. Now apply it to the columns of your DataFrame to get the 5% and 95% quantiles of each column. Check your results against the inbuilt pandas `quantile` function. *Note: You do not have to worry about interpolating values and you can use the `numpy sort` attribute for this question. However, **no other numpy functions** should be used!*


Use boolean indexing, and either your own function or the `quantile` function, to return a DataFrame containing only the subjects who were in the top 5\% quantile for `heartrate` and the bottom 5\% quantile for `size_of_left_toe`.

In [ ]:
# Write your answer here

**Question 5:** The range of the `age` column in the DataFrame is from 10 to 59 years old. Perform the following operations on the DataFrame;

 - Use the `cut` function to seperate subjects into 5 age groups, each of ten years in length. 
 

 - For each age range, obtain the mean `size_of_left_toe` and mean `heartrate` for male (`M`) subject and female (`F`) subjects seperately. Save a Dataframe containing these values as `mean_age_sex`. *Hint: Consider using the `groupby` function.*
 

 - For each age range, obtain the mean `size_of_left_toe` and mean `heartrate` for each of the groups listed in the `group` column (i.e. `a`, `b`, `c`, `d` and `e`). Save this in your workspace as `mean_age_group`. 
 

 - Stack `mean_age_sex` and `mean_age_group` on top of one another using the [`concat` function](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html). 
 

In practice, this is probably not a good way to lay out this data. List some reasons why you may not wish to lay out the data in this way.

In [ ]:
# Write your answer here...